app/views/items/_form.html.erb

    <%= f.label :category_id %><br>
    <%= collection_select(:item, :category_id, Category.all, :id, :title)      %>
---
SELECT  "categories".* FROM "categories"   ORDER BY "categories"."id" DESC LIMIT 1