app/controllers/items_controller.rb

  def new
    @categories = Category.all
---
SELECT  "categories".* FROM "categories"   ORDER BY "categories"."id" DESC LIMIT 1

  def create
    @item = Item.new(item_params)
    @item.save
---
INSERT INTO "items" ("category_id", "created_at", "details", "image", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category_id", 1], ["created_at", "2014-11-20 03:28:15.507296"], ["details", "test"], ["image", "ginger.jpg"], ["price", 12.0], ["title", "test"], ["updated_at", "2014-11-20 03:28:15.507296"]]

  def update
    @item.update(item_params)
---
UPDATE "items" SET "category_id" = $1, "image" = $2, "updated_at" = $3 WHERE "items"."id" = 3  [["category_id", 2], ["image", "image3.jpg"], ["updated_at", "2014-11-15 14:43:30.379013"]]

  def destroy
    @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]