app/controllers/symptoms_controller.rb

  def index
    @symptoms = Symptom.all
---
SELECT "symptoms".* FROM "symptoms"

  def create
    @symptom = Symptom.new(symptom_params)

    respond_to do |format|
      if @symptom.save
---
INSERT INTO "symptoms" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-15 02:13:47.528602"], ["title", "cough"], ["updated_at", "2014-11-15 02:13:47.528602"]]

    def set_symptom
      @symptom = Symptom.find(params[:id])
---
SELECT  "symptoms".* FROM "symptoms"  WHERE "symptoms"."id" = $1 LIMIT 1  [["id", 1]]