app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @tag = Tag.new(tag_params)
    @tag.save
---
INSERT INTO "tags" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-15 02:12:35.469450"], ["title", "dry"], ["updated_at", "2014-11-15 02:12:35.469450"]]

    def set_tag
      @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 1]]